In [5]:
'''Aplique as quatro formas de join estudadas nos seguintes dataframes: '''
import pandas as pd

df1 = pd.DataFrame({'A':[4,2,1,3], 'B':['a','b','c','d']})
df2 = pd.DataFrame({'A':[2,3,5], 'C':[10,20,30]})

print(df1)
print(df2)

   A  B
0  4  a
1  2  b
2  1  c
3  3  d
   A   C
0  2  10
1  3  20
2  5  30

In [6]:
df1.merge(df2, on = 'A', how= 'left')

   A  B     C
0  4  a   NaN
1  2  b  10.0
2  1  c   NaN
3  3  d  20.0

In [8]:
df2.merge(df1, on = 'A', how= 'left')

   A   C    B
0  2  10    b
1  3  20    d
2  5  30  NaN

In [9]:
df1.merge(df2, on = 'A', how= 'outer')

   A    B     C
0  4    a   NaN
1  2    b  10.0
2  1    c   NaN
3  3    d  20.0
4  5  NaN  30.0

In [10]:
df2.merge(df1, on = 'A', how= 'inner')

   A   C  B
0  2  10  b
1  3  20  d

In [14]:
'''Sobre o resultado do outer join anterior, ordene a saída pela coluna A (ajustar índices)'''

df1.merge(df2, on = 'A', how= 'outer').sort_values('A', ignore_index=True)

   A    B     C
0  1    c   NaN
1  2    b  10.0
2  3    d  20.0
3  4    a   NaN
4  5  NaN  30.0

In [19]:
'''Concatenar df1 e df2 em formato de linhas e depois colunas (ajustar índices)'''

pd.concat([df1,df2], ignore_index=True)

   A    B     C
0  4    a   NaN
1  2    b   NaN
2  1    c   NaN
3  3    d   NaN
4  2  NaN  10.0
5  3  NaN  20.0
6  5  NaN  30.0

In [20]:
pd.concat([df1,df2], ignore_index=True, axis=1)

   0  1    2     3
0  4  a  2.0  10.0
1  2  b  3.0  20.0
2  1  c  5.0  30.0
3  3  d  NaN   NaN

In [21]:
'''Calcule a soma da coluna A por agrupamento da coluna B no df1'''
df1.groupby('B')['A'].sum()

B
a    4
b    2
c    1
d    3
Name: A, dtype: int64